required_field = 'ช่องที่ต้องกรอกข้อมูล'

error_email_without_at = 'อีเมลไม่ถูกต้อง โปรดตรวจสอบความถูกต้อง'
error_email_without_dot = 'อีเมลไม่ถูกต้อง โปรดตรวจสอบความถูกต้อง'

invalid_first_and_last_name = "ช่องนี้มีได้เฉพาะอักขระละติน (A‑Z, a‑z), ยัติภังค์ และ "
invalid_email = 'อีเมลไม่ถูกต้อง โปรดตรวจสอบความถูกต้อง'
invalid_phone = 'รูปแบบตัวเลขไม่ถูกต้อง'
invalid_password = 'ช่องนี้ต้องมีอักขระมากกว่า 8 ตัว ตัวอักษรละตินอย่างน้อยหนึ่งตัว (A‑Z, a‑z) และตัวเลข (0‑9)'
checkbox_did_not_selected = 'คุณต้องยอมรับข้อกำหนดการใช้งานและนโยบายความเป็นส่วนตัว'

email_already_exists = 'มีบัญชีนี้อยู่แล้ว ลองเข้าสู่ระบบดูอีกครั้ง'

email_does_not_exist_in_db = 'อีเมลหรือรหัสผ่านไม่ถูกต้อง'

invalid_backup_code = 'รหัสไม่ถูกต้อง ลองเข้าใหม่อีกครั้ง'

error_limit_attempts = 'ความพยายามเกินจำนวนที่กำหนดแล้ว รอสักครู่แล้วลองอีกครั้ง'

wrong_2fa_code = 'เกินขีดจำกัดของความพยายามในการใส่รหัส ขอรหัส SMS ใหม่'

error_limit_2fa_codes = 'เกินขีดจำกัดของความพยายามในการใส่รหัส ขอรหัส SMS ใหม่'


